Re_5M/0deg_5nrg_SF/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          506570;
        startFace       505696;
    }
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          287;
        startFace       1012266;
    }
    outlet
    {
        type            inletOutlet;
        nFaces          566;
        startFace       1012553;
    }
    inlet
    {
        type            fixedValue;
        inGroups        List<word> 1(fixedValue);
        nFaces          895;
        startFace       1013119;
    }
)

// ************************************************************************* //
