Re_5M/0deg_5nrg_SF/system/Surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            surfaces;
libs            ("libsampling.so");

writeControl    writeTime;

surfaceFormat   raw;
interpolationScheme cellPoint;

fields       (p);

patchSurface
{
    type        patch;
    interpolate true;
}


surfaces
(
   
    airfoil
    {
        $patchSurface;
        patches     (wall);
    }
);

// ************************************************************************* //